In [1]:
import pandas as pd

In [3]:
companies ={
    'value': [220,160,140,117,94],
    'Change': [17.5,11.9,-8.5,-2.1,3.5],
    'Sector': ['Retail', 'Tech', 'Tech', 'Tech', 'Tech']
}

data = pd.DataFrame(companies, index=['Amazon', 'Google', 'Apple', 'Microsoft', 'Samsung'])
data

           value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsung       94     3.5    Tech

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Amazon to Samsung
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   value   5 non-null      int64
 1   Change  5 non-null      float64
 2   Sector  5 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 216.0+ bytes

In [5]:
data.columns

Index(['value', 'Change', 'Sector'], dtype='object')

In [6]:
data.index

Index(['Amazon', 'Google', 'Apple', 'Microsoft', 'Samsung'], dtype='object')

In [7]:
data.describe()

            value     Change
count    5.000000   5.000000
mean   146.200000   4.460000
std     48.095738  10.456003
min     94.000000  -8.500000
25%    117.000000  -2.100000
50%    140.000000   3.500000
75%    160.000000  11.900000
max    220.000000  17.500000

In [11]:
data.loc[data['value'] > 150]

        value  Change  Sector
Amazon    220    17.5  Retail
Google    160    11.9    Tech

In [12]:
data['Change']

Amazon       17.5
Google       11.9
Apple        -8.5
Microsoft    -2.1
Samsung       3.5
Name: Change, dtype: float64

In [13]:
data

           value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsung       94     3.5    Tech

In [14]:
data.iloc[3]

value      117
Change    -2.1
Sector    Tech
Name: Microsoft, dtype: object

In [15]:
data.iloc[1:4, 1:3]

           Change Sector
Google       11.9   Tech
Apple        -8.5   Tech
Microsoft    -2.1   Tech

In [16]:
data[0:3]

        value  Change  Sector
Amazon    220    17.5  Retail
Google    160    11.9    Tech
Apple     140    -8.5    Tech

In [17]:
data['Amazon':'Microsoft']

           value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech

In [18]:
data

           value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsung       94     3.5    Tech

In [19]:
data['value'].mul(2)

Amazon       440
Google       320
Apple        280
Microsoft    234
Samsung      188
Name: value, dtype: int64

In [20]:
data['value'].sub(2)

Amazon       218
Google       158
Apple        138
Microsoft    115
Samsung       92
Name: value, dtype: int64

In [21]:
data['value'].add(2)

Amazon       222
Google       162
Apple        142
Microsoft    119
Samsung       96
Name: value, dtype: int64

In [23]:
div, rem = divmod(data['value'],2)
div, rem